In [7]:
pwd

'C:\\Users\\rajesh'

In [ ]:
##MySQL (xampp) should be on.

In [ ]:
!pip install mysql.connector

In [10]:
import mysql.connector as sql
import pandas as pd
db_connection=sql.connect(host='localhost', database='mydb',user='root',password='')
db_cursor=db_connection.cursor()
db_cursor.execute('SELECT * FROM student')
table_rows=db_cursor.fetchall()
df=pd.DataFrame(table_rows, columns=[x[0] for x in db_cursor.description])

In [11]:
df

    roll      name   marks class
0      1      AJAY   70.12    TY
1      2       ram   81.95    FY
2      3    Aditya  604.95    SY
3      4    gaurav   81.95    TY
4      6      ramu   44.50    SY
5      7     kirti   72.30    SY
6      8      rani   82.95    SY
7      9   ranjeet   22.95    TY
8     10  rajneeti    5.95    FY
9     11     raman   84.95    TY
10    12      raju   12.95    TY
11    13   ranjeet   64.50    TY
12    15      anil   67.00    TY

In [12]:
table_rows

[(1, 'AJAY', 70.12, 'TY'),
 (2, 'ram', 81.95, 'FY'),
 (3, 'Aditya', 604.95, 'SY'),
 (4, 'gaurav', 81.95, 'TY'),
 (6, 'ramu', 44.5, 'SY'),
 (7, 'kirti', 72.3, 'SY'),
 (8, 'rani', 82.95, 'SY'),
 (9, 'ranjeet', 22.95, 'TY'),
 (10, 'rajneeti', 5.95, 'FY'),
 (11, 'raman', 84.95, 'TY'),
 (12, 'raju', 12.95, 'TY'),
 (13, 'ranjeet', 64.5, 'TY'),
 (15, 'anil', 67.0, 'TY')]